plugins/blog/src/Forms/PostForm.php

    public function buildForm()
    {
        $selected_categories = [];
        if ($this->getModel()) {
            $selected_categories = $this->getModel()->categories()->pluck('category_id')->all();
        }

        if (empty($selected_categories)) {
            $selected_categories = app(CategoryInterface::class)->getModel()->where('is_default', 1)->pluck('id')->all();
---
select `id` from `categories` where `is_default` = '1'