plugins/banner/src/Repositories/Eloquent/BannerRepository.php

    public function getFeatured()
    {
        $data = $this->model
            ->where([
                'banners.status' => 1,
            ])
            ->orderBy('banners.created_at', 'desc');
---
select * from `banners` where (`banners`.`status` = '1') order by `banners`.`created_at` desc